OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/peripheral/radio_test/radio_cmd.c
        case RADIO_TXPOWER_TXPOWER_Neg20dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg20dBm));
            break;

        case RADIO_TXPOWER_TXPOWER_Neg40dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg40dBm));
            break;

        default:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power unknown: %d", 
                            m_txpower);
            break;
    }

    switch (g_pattern)
    {
        case TRANSMIT_PATTERN_RANDOM:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_RANDOM));
            break;

        case TRANSMIT_PATTERN_11110000:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_11110000));
            break;

        case TRANSMIT_PATTERN_11001100:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_11110000));
            break;

        default:
            nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Transmission pattern unknown: %d", g_pattern);
            break;
    }

nrf_cli_fprintf(p_cli, 
                NRF_CLI_INFO, 
                "Start Channel:\t%lu\r\n"
                "End Channel:\t%lu\r\n"
                "Time on each channel: %lu ms\r\n"
                "Duty cycle:\t%lu percent\r\n",
                m_channel_start,
                m_channel_end,
                m_delay_ms,
                m_duty_cycle);
}


static void cmd_rx_sweep_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    radio_rx_sweep_start(m_mode, m_channel_start, m_channel_end, (uint8_t)m_delay_ms);
    m_sweep = true;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "RX sweep\r\n");
}


static void cmd_tx_sweep_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    radio_tx_sweep_start(m_txpower, m_mode, m_channel_start, m_channel_end, (uint8_t)m_delay_ms);
    m_sweep = true;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "TX sweep\r\n");
}


static void cmd_rx_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_sweep)
    {
        radio_sweep_end();
        m_sweep = false;
    }

 #ifdef NRF52840_XXAA
    ieee_channel_check(p_cli, m_channel_start);
#endif //NRF52840_XXAA 

    memset(g_rx_packet, 0, sizeof(g_rx_packet));

    radio_rx(m_mode, m_channel_start);
}


static void cmd_nrf_1mbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Nrf_1Mbit;
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data rate: %s\r\n", STRINGIFY_(RADIO_MODE_MODE_Nrf_1Mbit));
}


static void cmd_nrf_2mbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Nrf_2Mbit;
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data rate: %s\r\n", STRINGIFY_(RADIO_MODE_MODE_Nrf_2Mbit));
}


#ifdef  NRF52832_XXAA
static void cmd_nrf_250kbit(nrf_cli_t const * p_cli, size_t argc, char * * argv)
{
    m_mode = RADIO_MODE_MODE_Nrf_250Kbit;
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data rate: %s\r\n", STRINGIFY(RADIO_MODE_MODE_Nrf_250Kbit));
}


#endif // NRF52832_XXAA


static void cmd_ble_1mbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Ble_1Mbit;
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data rate: %s\r\n", STRINGIFY_(RADIO_MODE_MODE_Ble_1Mbit));
}


static void cmd_ble_2mbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Ble_2Mbit;
    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data rate: %s\r\n", STRINGIFY_(RADIO_MODE_MODE_Ble_2Mbit));
}


#ifdef NRF52840_XXAA
static void cmd_ble_lr125kbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Ble_LR125Kbit;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "Data rate: %s\r\n",
                    STRINGIFY_(RADIO_MODE_MODE_Ble_LR125Kbit));
}


static void cmd_ble_lr500kbit(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Ble_LR500Kbit;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "Data rate: %s\r\n",
                    STRINGIFY_(RADIO_MODE_MODE_Ble_LR500Kbit));
}


static void cmd_ble_ieee(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_mode = RADIO_MODE_MODE_Ieee802154_250Kbit;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "Data rate: %s\r\n",
                    STRINGIFY_(RADIO_MODE_MODE_Ieee802154_250Kbit));
}


#endif // NRF52840_XXAA


static void cmd_pattern_random(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    g_pattern = TRANSMIT_PATTERN_RANDOM;
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_INFO,
                    "Transmission pattern: %s.\r\n",
                    STRINGIFY_(TRANSMIT_PATTERN_RANDOM));
}


static void cmd_pattern_11110000(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    g_pattern = TRANSMIT_PATTERN_11110000;
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_INFO,
                    "Transmission pattern: %s.\r\n",
                    STRINGIFY_(TRANSMIT_PATTERN_11110000));
}


static void cmd_pattern_11001100(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    g_pattern = TRANSMIT_PATTERN_11001100;
    nrf_cli_fprintf(p_cli,
                    NRF_CLI_INFO,
                    "Transmission pattern: %s.\r\n",
                    STRINGIFY_(TRANSMIT_PATTERN_11001100));
}


static void cmd_toggle_dc(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count\r\n", argv[0]);
    }

    uint32_t state = atoi(argv[1]);

    if (state > 1)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Invalid DCDC value provided\n\r");
    }

    toggle_dcdc_state((uint8_t)state);

